Autodesk.Revit.UI.ToggleButtonData.#ctor(System.String,System.String)
Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand.
name: The internal name of the new button.
text: The user visible text seen on the new button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for one or more arguments.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for one or more arguments.
Since: 2011

Autodesk.Revit.UI.ToggleButtonData.#ctor(System.String,System.String,System.String,System.String)
Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked.
name: The internal name of the new button.
text: The user visible text seen on the new button.
assemblyName: The assembly path of the button.
className: The name of the class containing the implementation for the command.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for one or more arguments.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for one or more arguments.
Since: 2011

Autodesk.Revit.UI.ToggleButtonData
This class contains information necessary to construct a toggle button in a RadioButtonGroup.
Since: 2011